# import random
# # set_1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]
# # n = random.choice(set_1)

def Password_num(n): # функция получения пароля из исходного(введеного) числа, работает для любого дипазона не только от 3 до 20
    result = ""
    cnt = 0
    for i in range(1, n):
        for j in range(i + 1, n):
            cnt += 1  # Счетчик переборов по циклам (не обязателен для работы программы)
            if n % (i + j) == 0:
                result = result + str(i) + str(j)
    return result, cnt

def input_int(): # функция проверки на вводимое значение и перевод вводимого значения в целочисленое
    while True:
        s = input('Введите число от 3 до 20 или введите "Stop" для остановки программы xxxx: ')
        s = s.capitalize()
        if s == "Stop":
            return s
            break
        else:
            try:
                return int(s)
            except ValueError:
                print('------------------------------------------')
                print('- Ошибка. Ведено не допустимое значение! -')
                print('- не допускается ввод букв и пробелов    -')
                print('------------------------------------------')
                print()

while True:
    n = input_int()
    #password, cnt = Password_num(n)
    if n == "Stop":
        break
    password, cnt = Password_num(n)
    while n > 20: # ограничиваем допустимое исходное значение диапазоном от 3 до 20 согласно задаче
        print(f'---------------------------------------------------------------')
        print(f'- Пароль для числа {n}: Ошибка. Число не должно быть больше 20!')
        print(f'- Кол-во переборов по циклам: {cnt}')
        print(f'---------------------------------------------------------------')
        print()
        n = input_int()
    else:
        password, cnt = Password_num(n)
        if password == "":
            print(f'---------------------------------------------------------------')
            print(f'Пароль для числа {n}: Ошибка. Число не должно быть меньше 3!')
            print(f'Кол-во переборов по циклам: {cnt}')
            print(f'---------------------------------------------------------------')
            print()
        else:
            print(f'---------------------------------------------------------------')
            print(f'Пароль для числа {n}: {password}')
            print(f'Кол-во переборов по циклам: {cnt}')
            print(f'---------------------------------------------------------------')
            print()
